Tutorials/kOmegaSST/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(alpha1)    Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)  Gauss SFCD;
    div(phi,alpha)  Gauss vanLeer01;
    div(phirb,alpha) Gauss interfaceCompression;
   div(rhi*phi,k)      Gauss Minmod;
    div(rho*phi,omega) Gauss Minmod;

   div(phi,k)      Gauss upwind;
    div(phi,omega) Gauss upwind;
 div((muEff*dev(T(grad(U))))) Gauss linear;
   div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}
fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    alpha.,water;
}

// ************************************************************************* //
